name: "self_circular_dependency"
max_batch_size: 2
platform: "ensemble"
ensemble_scheduling {
  step [
    {
      model_name: "fp32_dim1_batch4"
      model_version: -1
      input_map {
        key: "INPUT0"
        value: "data"
      }
      output_map {
        key: "OUTPUT0"
        value: "temp_tensor_4"
      }
    },
    {
      model_name: "fp32_dim1_batch4_output3"
      model_version: -1
      input_map {
        key: "INPUT0"
        value: "data"
      }
      input_map {
        key: "INPUT1"
        value: "data"
      }
      input_map {
        key: "INPUT2"
        value: "data"
      }
      output_map {
        key: "OUTPUT0"
        value: "temp_tensor_1"
      }
      output_map {
        key: "OUTPUT1"
        value: "temp_tensor_2"
      }
      output_map {
        key: "OUTPUT2"
        value: "temp_tensor_3"
      }
    },
    {
      model_name: "fp32_dim1_batch4_input4"
      model_version: -1
      input_map {
        key: "INPUT0"
        value: "temp_tensor_1"
      }
      input_map {
        key: "INPUT1"
        value: "temp_tensor_2"
      }
      input_map {
        key: "INPUT2"
        value: "temp_tensor_3"
      }
      input_map {
        key: "INPUT3"
        value: "temp_tensor_4"
      }
      output_map {
        key: "OUTPUT0"
        value: "temp_tensor_5"
      }
    },
    {
      model_name: "self_circular_dependency"
      model_version: -1
      input_map {
        key: "data"
        value: "temp_tensor_5"
      }
      output_map {
        key: "prob"
        value: "prob"
      }
    }
  ]
}
input [
  {
    name: "data"
    data_type: TYPE_FP32
    dims: [ 16 ]
  }
]
output [
  {
    name: "prob"
    data_type: TYPE_FP32
    dims: [ 16 ]
  }
]
