name: "no_required_version_2"
platform: "ensemble"
max_batch_size: 8
input [
  {
    name: "INPUT0"
    data_type: TYPE_INT32
    dims: [ 16 ]
  },
  {
    name: "INPUT1"
    data_type: TYPE_INT32
    dims: [ 16 ]
  }
]
output [
  {
    name: "OUTPUT0"
    data_type: TYPE_INT32
    dims: [ 16 ]
  },
  {
    name: "OUTPUT1"
    data_type: TYPE_INT32
    dims: [ 16 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "simple"
      model_version: -1
      input_map {
        key: "INPUT0"
        value: "INPUT0"
      }
      input_map {
        key: "INPUT1"
        value: "INPUT1"
      }
      output_map {
        key: "OUTPUT0"
        value: "temp0"
      }
      output_map {
        key: "OUTPUT1"
        value: "temp1"
      }
    },
    {
      model_name: "simple"
      model_version: 2
      input_map {
        key: "INPUT0"
        value: "temp0"
      }
      input_map {
        key: "INPUT1"
        value: "temp1"
      }
      output_map {
        key: "OUTPUT0"
        value: "OUTPUT0"
      }
      output_map {
        key: "OUTPUT1"
        value: "OUTPUT1"
      }
    }
  ]
}
