backend: "python"
max_batch_size: 0
model_transaction_policy { decoupled: true }
input [
  { name: "text_input" data_type: TYPE_STRING dims: [ 1, 1 ] },
  { name: "stream" data_type: TYPE_BOOL dims: [ 1, 1 ] },
  { name: "max_tokens" data_type: TYPE_INT32 dims: [ 1, 1 ] optional: true },
  { name: "temperature" data_type: TYPE_FP32 dims: [ 1, 1 ] optional: true },
  { name: "top_p" data_type: TYPE_FP32 dims: [ 1, 1 ] optional: true },
  { name: "frequency_penalty" data_type: TYPE_FP32 dims: [ 1, 1 ] optional: true },
  { name: "presence_penalty" data_type: TYPE_FP32 dims: [ 1, 1 ] optional: true }
]
output [
  { name: "text_output" data_type: TYPE_STRING dims: [ 1, -1 ] }
]
instance_group [ { count: 1 kind: KIND_CPU } ]
