name: "circular_dependency_2"
max_batch_size: 2
platform: "trtis_ensemble"
ensemble_scheduling {
  step [
    {
      model_name: "circular_dependency"
      input_map {
        key: "input"
        value: "data"
      }
      output_map {
        key: "prob"
        value: "output"
      }
    }
  ]
}
input [
  {
    name: "data"
    data_type: TYPE_FP32
    dims: [ 16 ]
  }
]
output [
  {
    name: "prob"
    data_type: TYPE_FP32
    dims: [ 16 ]
  }
]
