max_batch_size: 1
platform: "tensorflow_savedmodel"
input [
  {
    name: "INPUT1"
    data_type: TYPE_INT32
    dims: [ 16 ]
  }
]
output [
  {
    name: "OUTPUT0"
    data_type: TYPE_INT8
    dims: [ 16 ]
  },
  {
    name: "OUTPUT1"
    data_type: TYPE_INT8
    dims: [ 16 ]
  }
]
