name: "int32_dim1_batch4"
max_batch_size: 4
platform: "custom"
input [
  {
    name: "input"
    data_type: TYPE_INT32
    dims: [ 16 ]
  }
]
output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [ 16 ]
  }
]