name: "fp32_dim1_batch2"
max_batch_size: 2
platform: "custom"
input [
  {
    name: "INPUT0"
    data_type: TYPE_FP32
    dims: [ 16 ]
  }
]
output [
  {
    name: "OUTPUT0"
    data_type: TYPE_FP32
    dims: [ 16 ]
  }
]
instance_group [
  {
    kind: KIND_CPU
  }
]
