# Copyright (c) 2019, NVIDIA CORPORATION. All rights reserved.
#
# Redistribution and use in source and binary forms, with or without
# modification, are permitted provided that the following conditions
# are met:
#  * Redistributions of source code must retain the above copyright
#    notice, this list of conditions and the following disclaimer.
#  * Redistributions in binary form must reproduce the above copyright
#    notice, this list of conditions and the following disclaimer in the
#    documentation and/or other materials provided with the distribution.
#  * Neither the name of NVIDIA CORPORATION nor the names of its
#    contributors may be used to endorse or promote products derived
#    from this software without specific prior written permission.
#
# THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS ``AS IS'' AND ANY
# EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
# IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
# PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT OWNER OR
# CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
# EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
# PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
# PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY
# OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
# (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
# OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

name: "mix_ensemble_int32_float32_float32"
platform: "ensemble"
max_batch_size: 8
input [
  {
    name: "INPUT0"
    data_type: TYPE_INT32
    dims: [ 16 ]
  },
  {
    name: "INPUT1"
    data_type: TYPE_INT32
    dims: [ 16 ]
  }
]
output [
  {
    name: "OUTPUT0"
    data_type: TYPE_FP32
    dims: [ 16 ]
  },
  {
    name: "OUTPUT1"
    data_type: TYPE_FP32
    dims: [ 16 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "graphdef_int32_int32_int32"
      model_version: 1
      input_map {
        key: "INPUT0"
        value: "INPUT0"
      }
      input_map {
        key: "INPUT1"
        value: "INPUT1"
      }
      output_map {
        key: "OUTPUT0"
        value: "add_value_int"
      }
    },
    {
      model_name: "graphdef_int32_object_object"
      model_version: 1
      input_map {
        key: "INPUT0"
        value: "add_value_int"
      }
      input_map {
        key: "INPUT1"
        value: "INPUT1"
      }
      output_map {
        key: "OUTPUT1"
        value: "input_0_object"
      }
    },
    {
      model_name: "graphdef_int32_object_object"
      model_version: 1
      input_map {
        key: "INPUT0"
        value: "add_value_int"
      }
      input_map {
        key: "INPUT1"
        value: "INPUT0"
      }
      output_map {
        key: "OUTPUT1"
        value: "input_1_object"
      }
    },
    {
      model_name: "graphdef_object_int32_int32"
      model_version: 1
      input_map {
        key: "INPUT0"
        value: "input_0_object"
      }
      input_map {
        key: "INPUT1"
        value: "input_1_object"
      }
      output_map {
        key: "OUTPUT0"
        value: "another_add_value_int"
      }
    },
    {
      model_name: "mix_type_int32_float32_float32"
      model_version: 1
      input_map {
        key: "INPUT0"
        value: "another_add_value_int"
      }
      input_map {
        key: "INPUT1"
        value: "INPUT1"
      }
      output_map {
        key: "OUTPUT1"
        value: "input_0_float"
      }
    },
    {
      model_name: "mix_type_int32_float32_float32"
      model_version: 1
      input_map {
        key: "INPUT0"
        value: "another_add_value_int"
      }
      input_map {
        key: "INPUT1"
        value: "INPUT0"
      }
      output_map {
        key: "OUTPUT1"
        value: "input_1_float"
      }
    },
    {
      model_name: "mix_platform_float32_float32_float32"
      model_version: 1
      input_map {
        key: "INPUT0"
        value: "input_0_float"
      }
      input_map {
        key: "INPUT1"
        value: "input_1_float"
      }
      output_map {
        key: "OUTPUT0"
        value: "OUTPUT0"
      }
      output_map {
        key: "OUTPUT1"
        value: "OUTPUT1"
      }
    }
  ]
}
