name: "identity_fp32"
backend: "python"
platform: "custom"
max_batch_size: 64

input [
  {
    name: "IN"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]

output [
  {
    name: "OUT"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]
