# Copyright (c) 2025, NVIDIA CORPORATION. All rights reserved.
# 
# Redistribution and use in source and binary forms, with or without
# modification, are permitted provided that the following conditions
# are met:
#  * Redistributions of source code must retain the above copyright
#    notice, this list of conditions and the following disclaimer.
#  * Redistributions in binary form must reproduce the above copyright
#    notice, this list of conditions and the following disclaimer in the
#    documentation and/or other materials provided with the distribution.
#  * Neither the name of NVIDIA CORPORATION nor the names of its
#    contributors may be used to endorse or promote products derived
#    from this software without specific prior written permission.
# 
# THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS ``AS IS'' AND ANY
# EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
# IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
# PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT OWNER OR
# CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
# EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
# PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
# PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY
# OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
# (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
# OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
name: "unreachable_output_3"
max_batch_size: 2
platform: "ensemble"
ensemble_scheduling {
  step [
    {
      model_name: "fp32_dim1_batch4"
      model_version: -1
      input_map {
        key: "input"
        value: "data"
      }
      output_map {
        key: "output"
        value: "temp_tensor_4"
      }
    },
    {
      model_name: "fp32_dim1_batch4"
      model_version: -1
      input_map {
        key: "input"
        value: "not_written_tensor"
      }
      output_map {
        key: "output"
        value: "prob_2"
      }
    },
    {
      model_name: "fp32_dim1_batch4_output3"
      model_version: -1
      input_map {
        key: "input"
        value: "data"
      }
      output_map {
        key: "output1"
        value: "temp_tensor_1"
      }
      output_map {
        key: "output2"
        value: "temp_tensor_2"
      }
      output_map {
        key: "output3"
        value: "temp_tensor_3"
      }
    },
    {
      model_name: "fp32_dim1_batch4_input4"
      model_version: -1
      input_map {
        key: "input1"
        value: "temp_tensor_1"
      }
      input_map {
        key: "input2"
        value: "temp_tensor_2"
      }
      input_map {
        key: "input3"
        value: "temp_tensor_3"
      }
      input_map {
        key: "input4"
        value: "temp_tensor_4"
      }
      output_map {
        key: "output"
        value: "prob"
      }
    }
  ]
}
input [
  {
    name: "data"
    data_type: TYPE_FP32
    dims: [ 16 ]
  }
]
output [
  {
    name: "prob"
    data_type: TYPE_FP32
    dims: [ 16 ]
  },
  {
    name: "prob_2"
    data_type: TYPE_FP32
    dims: [ 16 ]
  }
]
