# Copyright (c) 2020, NVIDIA CORPORATION. All rights reserved.
#
# Redistribution and use in source and binary forms, with or without
# modification, are permitted provided that the following conditions
# are met:
#  * Redistributions of source code must retain the above copyright
#    notice, this list of conditions and the following disclaimer.
#  * Redistributions in binary form must reproduce the above copyright
#    notice, this list of conditions and the following disclaimer in the
#    documentation and/or other materials provided with the distribution.
#  * Neither the name of NVIDIA CORPORATION nor the names of its
#    contributors may be used to endorse or promote products derived
#    from this software without specific prior written permission.
#
# THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS ``AS IS'' AND ANY
# EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
# IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
# PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT OWNER OR
# CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
# EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
# PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
# PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY
# OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
# (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
# OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

name: "invalid_decoupled_branching"
max_batch_size: 0
platform: "ensemble"
ensemble_scheduling {
  step [
    {
      model_name: "repeat_int32"
      model_version: -1
      input_map {
        key: "IN"
        value: "IN"
      }
      input_map {
        key: "DELAY"
        value: "DELAY"
      }
      input_map {
        key: "WAIT"
        value: "WAIT"
      }
      output_map {
        key: "OUT"
        value: "repeat_1_out"
      }
    },
    {
      model_name: "repeat_int32"
      model_version: -1
      input_map {
        key: "IN"
        value: "IN"
      }
      input_map {
        key: "DELAY"
        value: "DELAY"
      }
      input_map {
        key: "WAIT"
        value: "WAIT"
      }
      output_map {
        key: "OUT"
        value: "repeat_2_out"
      }
    },
    {
      model_name: "int32_dim1_nobatch_output2"
      model_version: -1
      input_map {
        key: "INPUT0"
        value: "repeat_1_out"
      }
      input_map {
        key: "INPUT1"
        value: "repeat_2_out"
      }
      output_map {
        key: "OUTPUT0"
        value: "identity_0"
      }
      output_map {
        key: "OUTPUT1"
        value: "identity_1"
      }
    },
    {
      model_name: "int32_dim1_nobatch_output2"
      model_version: -1
      input_map {
        key: "INPUT0"
        value: "identity_0"
      }
      input_map {
        key: "INPUT1"
        value: "identity_1"
      }
      output_map {
        key: "OUTPUT0"
        value: "OUT"
      }
    }
  ]
}
input [
  {
    name: "IN"
    data_type: TYPE_INT32
    dims: [ -1 ]
  },
  {
    name: "DELAY"
    data_type: TYPE_UINT32
    dims: [ -1 ]
  },
  {
    name: "WAIT"
    data_type: TYPE_UINT32
    dims: [ 1 ]
  }
]
output [
  {
    name: "OUT"
    data_type: TYPE_INT32
    dims: [ 1 ]
  }
]
