name: "conflicting_scheduler_ensemble"
platform: "ensemble"
input [
  {
    name: "ENSEMBLE_INPUT0"
    data_type: TYPE_FP32
    dims: [ 4 ]
  }
]
output [
  {
    name: "ENSEMBLE_OUTPUT0"
    data_type: TYPE_FP32
    dims: [ 4 ]
  }
]
ensemble_scheduling {
  step [
    {
      # batch model
      model_name: "ensemble_first_step"
      model_version: 1
      input_map {
        key: "INPUT0"
        value: "ENSEMBLE_INPUT0"
      }
      output_map {
        key: "OUTPUT0"
        value: "temp_output_0"
      }
    },
    {
      model_name: "ensemble_second_step"
      model_version: 1
      input_map {
        key: "INPUT0"
        value: "temp_output_0"
      }
      output_map {
        key: "OUTPUT0"
        value: "ENSEMBLE_OUTPUT0"
      }
    }
  ]
}
