name: "pytorch_model"
backend: "python"
platform: "custom"

input [
  {
    name: "IN"
    data_type: TYPE_FP32
    dims: [ 1, 1, 28, 28 ]
  }
]

output [
  {
    name: "OUT"
    data_type: TYPE_FP32
    dims: [ 1, 10 ]
  }
]
