name: "text_recognition"
platform: "onnxruntime_onnx"
max_batch_size : 8
input [
  {
    name: "input.1"
    data_type: TYPE_FP32
    dims: [ 1, 32, 100 ]
  }
]
output [
  {
    name: "308"
    data_type: TYPE_FP32
    dims: [ 26, 37 ]
  }
]
#dynamic_batching {
#    max_queue_delay_microseconds: 100
#}


dynamic_batching { }
instance_group [
    {
      count: 2
      kind: KIND_GPU
    }
]
